
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Билетики Приход
	Движения.Билетики.Записывать = Истина;
	Для Каждого ТекСтрокаФильмы Из Фильмы Цикл
		Движение = Движения.Билетики.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Фильмы = ТекСтрокаФильмы.Фильм;
		Движение.Количество = ТекСтрокаФильмы.Количество;
		Движение.Цена = ТекСтрокаФильмы.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
