&НаСервере
Процедура СовершитьОперацию(ПрибыльЛи, Сумма)
	Оп_ия = ВнешниеИсточникиДанных.БД.Таблицы.ОперацииТаблица.СоздатьОбъект();
	Оп_ия.date = ТекущаяДата();
	Оп_ия.employeeName = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Оп_ия.isArrival = ПрибыльЛи;
	Оп_ия.price = ?(ПрибыльЛи, Сумма, -Сумма);
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("name", "Магазин одежды");
	Оп_ия.companyID = 1; //ВнешниеИсточникиДанных.БД.Таблицы.КомпанииТаблица.НайтиСтроки(СтруктураПоиска);
	
	Оп_ия.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	a=Элементы.накладная.ТекущиеДанные.Количество ;
	b=Элементы.накладная.ТекущиеДанные.Номенклатура ;
	УсловиеЗаписи(Отказ, a, b, ПараметрыЗаписи);
	Если Отказ = Ложь Тогда 
		СовершитьОперацию(Истина, Элементы.Накладная.ТекущиеДанные.Сумма);
	конецесли;
КонецПроцедуры

&НаСервере
Процедура УсловиеЗаписи(Отказ, a, b, ПараметрыЗаписи)
	Запрос = Новый запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ОстаткиОстатки.Номенклатура КАК Номенклатура,
	              |	ОстаткиОстатки.КоличествоОстаток КАК Количество
	              |ИЗ
	              |	РегистрНакопления.Остатки.Остатки КАК ОстаткиОстатки";
	
		
	Результат = Запрос.Выполнить();
	Запрос.УстановитьПараметр("Номенклатура",b);
	//Количество=0;
	Выборка= Результат.Выбрать();
	пока Выборка.НайтиСледующий(b, "Номенклатура") цикл
	Количество = Выборка.Количество;
	конеццикла;
	
	если (a > Количество) тогда
	сообщить("Недостаточно товара, осталось  "+ (Количество) );
	Отказ = Истина;
	иначе
	
	конецесли;
КонецПроцедуры


&НаКлиенте
Процедура НакладнаяКоличествоПриИзменении(Элемент)
	Элементы.накладная.ТекущиеДанные.Сумма=Элементы.накладная.ТекущиеДанные.Количество*Элементы.накладная.ТекущиеДанные.Цена;
КонецПроцедуры

