
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	a=Элементы.накладная.ТекущиеДанные.Количество ;
	b=Элементы.накладная.ТекущиеДанные.Номенклатура ;
	УсловиеЗаписи(Отказ, a, b, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура УсловиеЗаписи(Отказ, a, b, ПараметрыЗаписи)
	Запрос = Новый запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ОстаткиОстатки.Номенклатура КАК Номенклатура,
	              |	ОстаткиОстатки.КоличествоОстаток КАК КоличествоОстаток
	              |ИЗ
	              |	РегистрНакопления.Остатки.Остатки КАК ОстаткиОстатки";
	
		
	Результат = Запрос.Выполнить();
	Запрос.УстановитьПараметр("Номенклатура",b);
	//Количество=0;
	Выборка= Результат.Выбрать();
	пока Выборка.НайтиСледующий(b,"Номенклатура") цикл
	Количество = Выборка.Количество;
	конеццикла;
	
	если (a > Количество) тогда
	сообщить("Недостаточно товара, осталось  "+ (Количество) );
	Отказ = Истина;
	иначе
		
	конецесли;
КонецПроцедуры


&НаКлиенте
Процедура НакладнаяКоличествоПриИзменении(Элемент)
	Элементы.накладная.ТекущиеДанные.Сумма=Элементы.накладная.ТекущиеДанные.Количество*Элементы.накладная.ТекущиеДанные.Цена;
КонецПроцедуры

