
&НаКлиенте
Процедура ТабличнаяЧасть1ЦенаПриИзменении(Элемент)
	Элементы.ТабличнаяЧасть1.ТекущиеДанные.ОбщийДоход=Элементы.ТабличнаяЧасть1.ТекущиеДанные.Количество*Элементы.ТабличнаяЧасть1.ТекущиеДанные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	a=Элементы.ТабличнаяЧасть1.ТекущиеДанные.Количество ;
	b=Элементы.ТабличнаяЧасть1.ТекущиеДанные.Фильмы ;
	УсловиеЗаписи(Отказ, a, b, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура УсловиеЗаписи(Отказ, a, b, ПараметрыЗаписи)
	Запрос = Новый запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	БилетикиОстатки.Фильмы КАК Фильмы,
	              |	БилетикиОстатки.КоличествоОстаток КАК КоличествоОстаток,
	              |	БилетикиОстатки.ЦенаОстаток КАК ЦенаОстаток
	              |ИЗ
	              |	РегистрНакопления.Билетики.Остатки КАК БилетикиОстатки";
	
		
	Результат = Запрос.Выполнить();
	Запрос.УстановитьПараметр("Фильмы",b);
	//Количество=0;
	Выборка= Результат.Выбрать();
	пока Выборка.НайтиСледующий(b,"Фильмы") цикл
	Количество = Выборка.Количество;
	конеццикла;
	
	если (a > Количество) тогда
	сообщить("Недостаточно товара, осталось  "+ (Количество) );
	Отказ = Истина;
	иначе
		
	конецесли;
КонецПроцедуры
